{
  "main": {
    "name": "Kevin Lau",
    "occupation": "coder/designer who loves beautiful things",
    "description": "Changing the world one keystroke at a time.",
    "image": "profilepic.jpg",
    "bio": "Never Never Never Give up",
    "contactmessage": "Please email me. The form below doesn't work.",
    "email": "REMOVEDTHISkevinlau11@post.harvard.edu",
    "phone": "+852-6400-6851",
    "address": {
      "street": "Winner Building, BLK 8, No.8-16 Wing Wah Lane",
      "city": "Hong Kong",
      "state": "Central",
      "zip": ""
    },
    "website": "http://www.fitcampapp.com",
    "resumedownload": "http://fitcampapp.com",
    "social": [
      {
        "name": "github",
        "url": "https://github.com/InfiniteRandomVariable",
        "className": "fa fa-github"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com",
        "className": "fa fa-twitter"
      },
      {
        "name": "google-plus",
        "url": "http://googleplus.com",
        "className": "fa fa-google-plus"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com",
        "className": "fa fa-instagram"
      },

      {
        "name": "skype",
        "url": "http://skype.com",
        "className": "fa fa-skype"
      }
    ]
  },
  "resume": {
    "skillmessage": "Problem Solver / Jack of All Trade / Generalist",
    "education": [
      {
        "school": "Harvard University",
        "degree": "Graduate Program in Engineering School - Computer Science",
        "graduated": "2011",
        "description": "GPA 3.68 - Programming Coursework: Elements of Software Construction at MIT, Human & Computer Interaction in Research (PHD course), Visualization."
      },
      {
        "school": "Bond University",
        "degree": " Psychology & Biomedical Science",
        "graduated": "2004",
        "description": "Understanding of human behavior and biology."
      }
    ],
    "work": [
      {
        "company": "Allytic App",
        "title": "Founder, Developer and UX design",
        "years": "2019 - Present",
        "description": "Helped retailers/vendors/marketers to form alliance and made intelligent group decision and increased collective group purchasing power by analyzing business performance, best selling products and identified trend, featuring accounting POS, access control and inventory management."
      },
      {
        "company": "Fitcamp App",
        "title": "Founder, Developer and UX design",
        "years": "2015 - 2017",
        "description": "An iOS app with full iCloud architecture integration enabled the benefits of omitting the troubling processes of sign up and log in while leveraged the full security and efficiency of Apple authentication service for free, without the need to maintain the service. Support first generation AppleWatch app.  Developed and designed multiple complex scenarios for connecting user to exercise together instantly with minimal efforts on the user’s part by an Uber-like single page effortless design. Designed a secure and safe environment for fitness people to exercise together. Users could talk and interact with each other in real time while following any exercise routine."
      },
      {
        "company": "Hotopy App",
        "title": "Founder, Developer and UX design",
        "years": "2013 - 2014",
        "description": "An iOS app and web app, automated web robots to scrape and organized the top comment and photo from multiple news agencies for most current news and top comments, every two hours. One Page Web and App design."
      },
      {
        "company": "VoicePhoto App",
        "title": "Founder, Developer and UX design",
        "years": "2011 - 2013",
        "description": "An iOS App with full Instagram-like features. Enabled recording and added user’s voice to photos for photo narration and storytelling by“inventing” audio-photo format and slideshow with voice narration. Reduced the size of the audio-photo file by 90% with high fidelity to the original works. Performance optimization for mass photo downloads for the photo collage scroll view. Dynamically retrieved and erased photos for memory optimization for increased app responsiveness. Implemented common social networking features such as accepting, inviting friends and manage profile, hashtag, “like” and conversation. Integrated and published video content to both the app and website for multi-platform supports while using a common RESTFUL backend, achieved this efficiency by iOS device posting encrypted authorization to write to content distributed network, AWS S3, the secure authorization is a temporary authorized token generated by RESTFul server backend."
      },
      {
        "company": "Thecourseworks.com",
        "title": "Founder, Developer and UX design",
        "years": "2010 - 2011",
        "description": "helped matching and finding team members for school courseworks. Teammates were required to sign a contract and built matrices to increase accountability and keep records of course work. Used graphical interface to visualize the member performance and satisfaction resulting from the reviews of peers. Scoring and reputation system was used to reward the high-performers."
      },
      {
        "company": "Philaz.com",
        "title": "Founder, Developer and UX design",
        "years": "2007 - 2009",
        "description": "A social networking targeting families and closed friends. From ideation to creation, defined and achieved objectives through user interface design for a social networking site. Worked remotely with a team of programmers in India, debugged, evaluated progress and met deadlines. Streamlined and combined features to synchronize a cohesive experience. Pioneered one page design for many features at the time when its was novelty, by consistent separation of sidebar menu and dynamic content."
      }
    ],
    "skills": [
      {
        "name": "Swift",
        "level": "75%"
      },
      {
        "name": "ReactJs",
        "level": "68%"
      },
      {
        "name": "Objective-C",
        "level": "80%"
      },
      {
        "name": "System Design & AWS",
        "level": "85%"
      },
      {
        "name": "UX Design",
        "level": "90%"
      },
      {
        "name": "MongoDB",
        "level": "45%"
      },
      {
        "name": "NOSQL",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Evernote Clone (Optimized)",
        "category": "Use React to help people taking note on the fly - React Class Components.",
        "image": "EverNoteLandingPage.jpg",
        "url": "http://www.fitcampapp.com"
      },
      {
        "title": "My Company Website",
        "category": "CSS, Javascript",
        "image": "prolightinglandingpage.jpg",
        "url": "http://www.prolightingcn.com"
      },
      {
        "title": "Fitcamp App",
        "category": "Instantly connect people working out",
        "image": "fitcampappLandingPage.jpg",
        "url": "http://www.fitcampapp.com"
      },
      {
        "title": "Todoist Clone",
        "category": "Use React to help people create a todo list - Use React Hooks.",
        "image": "ToDoListLandingPage.jpg",
        "url": "http://www.fitcampapp.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Very Driven",
        "user": "Tim Yu - Colleague/co-programmer"
      },
      {
        "text": "Hard working",
        "user": "Mike Yu - Supervisor"
      }
    ]
  }
}
